/*
 * 1. github의 gapminder.tsv 파일 다운로드
 * 2. 파일의 내용을 저장할 수 있는 테이블을 생성.
 *    테이블 이름: GAPMINDER
 *    컬럼: COUNTRY, CONTINENT, YEAR, LIFE_EXP, POP, GDP_PERCAP
 * 3. SQLDeveloper의 데이터 임포트 기능을 사용해서 파일의 내용을 테이블에 임포트
 * 4. 테이블에는 모두 몇 개의 나라가 있을까요?
 * 5. 테이블에는 모두 몇 개의 대륙이 있을까요?
 * 6. 테이블에는 저장된 데이터는 몇년도부터 몇년도까지 조사한 내용일까요?
 * 7. 평균 수명이 최댓값인 레코드(row)를 찾으세요.
 * 8. 인구가 최댓값인 레코드(row)를 찾으세요.
 * 9. 1인당 GDP가 최댓값인 레코드(row)를 찾으세요.
 * 10. 우리나라의 통계 자료만 출력하세요.
 * 11. 연도별 1인당 GDP의 최댓값인 레코드를 찾으세요.
 * 12. 대륙별 1인당 GDP의 최댓값인 레코드를 찾으세요.
 * 13. 연도별, 대륙별 인구수를 출력하세요.
 *     인구수가 가장 많은 연도와 대륙은 어디인가요?
 * 14. 연도별, 대륙별 평균 수명의 평균을 출력하세요.
 *     평균 수명이 가장 긴 연도와 대륙은 어디인가요?
 * 15. 연도별, 대륙별 1인당 GDP의 평균을 출력하세요.
 *     1인당 GDP의 평균이 가장 큰 연도와 대륙은 어디인가요?
 * 16. 13번 문제의 결과에서 대륙이름이 컬럼이 되도록 출력하세요.
 * 17. 14번 문제의 결과에서 대륙이름이 컬럼이 되도록 출력하세요.
 * 18. 15번 문제의 결과에서 대륙이름이 컬럼이 되도록 출력하세요.
 */
